{
  "projects": "Progetti",
  "languages": "Lingue",
  "contact": "Contatti",
  "job_title": "Ingegnere Informatico Junior Full-Stack di Software",
  "software_engineering": "Ingegneria di Software",
  "welcome": "Benevenuto. Joaquim lavora come ingegnere informatico - software junior full-stack presso a Softwave-Soltec.",
  "cv_title": "CV Sito-Web di Joaquim Barreto",
  "statement_title": "Profilo personale",
  "statement": "Ingegnere software full-stack con la passione per la creazione di app Web esteticamente belle e pienamente funzionanti. Con esperienza in Angular 9, JavaScript e Kubernetes e un background nel cinema, nella fotografia e nell'economia, Joaquim ha scoperto lo sviluppo web attraverso il suo forte desiderio di continuare l'apprendimento. Joaquim porta forti competenze nel team building e nella gestione dei progetti che aiutano a massimizzare la crescita in tutti i principali obiettivi.",
  "here": "qui",
  "see_repositories": "per visualizzare l'archivio.",
  "see_cv": "per visualizzare il CV di Joaquim.",
  "adventures": "Esperienze in Ingegneria Software",
  "blog_desc": "Da economista a fotografo / cambiare lavoro da regista ad ingegnere del software ha i suoi rischi. Esplora le prove e le esperienze di Joaquim mentre si allea con il mondo dell'era dell'informazione.",
  "featured_projects": "Progetti in Primo Piano",
  "open_app": "Open App",
  "freelance_booking_desc": "Questa app è stato il progetto finale di Joaquim mentre conseguiva l'abilitazione informatica alla Flatiron School. È un'app che consente la prenotazione di servizi in maniera funzionale ed efficiente. Utilizza Ruby on Rails con ActiveAdmin sul back-end con Javascript e React sul front-end.",
  "mern_desc": "Questa app è un semplice task manager. Le tecnologie utilizzate nel back-end sono Node.js, Express.js e Mongoose.js. Il front-end è stato fatto in React.js. Il database scelto è MongoDB e l'autenticazione eseguita con JWT. Schierato su Heroku.",
  "pig_latin_desc": "Questa app è il risultato del tentativo di Joaquim di utilizzare il codice di traduzione pig latin per l'inglese. Questa app viene trasformata in uno stack MEAN utilizzando NgRX.",
  "htotil_desc": "Un'app divertente. Risponde ad un dilemma che abbiamo tutto quando prendiamo decisioni. Ora non più poiché questa app aiuterà a prendere decisioni. Questa app usa React Hooks (useState e useEfect) sul frontend. Distribuito su Netlify.",
  "house_md_desc": "Questa app è un progetto di programmazione a coppie pensato durante il secondo modulo 2 di sviluppo presso la Flatiron School. È un'app che consente di diagnosticare sintomi sul proprio corpo. L'app usa su Ruby on Rails sul back-end con Javascript e React sul frontend. Schierato su Heroku.",
  "flatiron_sass_desc": "Questa app è stata il progetto di programmazione a coppie di Joaquim durante il modulo 3 presso la Flatiron School. Un'app per i tutor scolastici che consente di registrare la frequenza degli studenti. Utilizza Ruby on Rails sul back-end con Javascript sul front-end.",
  "sdw_app_desc": "Questa app di prenotazione è un progetto di programmazione di coppia pensata durante il modulo 2 presso la Flatiron School. È un'app che consente di prenotare spazi nei cantieri di Pullen per scopi cinematografici e fotografici. L'app viene utilizzata su Ruby su Rails con Bootstrap CSS. Schierato su Heroku.",
  "technical_projects": "Progetti Tecnici",
  "professional_experience": "Esperienza Professionale",
  "technical_skills": "Competenze Tecniche",
  "employment_history": "Esperienze lavorative",
  "education": "Istruzione",
  "photographer": "Fotografo",
  "economist": "Economista",
  "filmmaker": "Regista",
  "january": "Gennaio",
  "march": "Marzo",
  "october": "Ottobre",
  "december": "Dicembre",
  "july": "Luglio",
  "june": "Giugno",
  "present": "Presente",
  "italy": "Italia",
  "uk": "Regno Unito",
  "london": "Londra",
  "rome": "Roma",
  "china": "Cina",
  "english": "Inglese",
  "italian": "Italiano",
  "mandarin": "Cinese",
  "japanese": "Giaponnese",
  "portuguese": "Portoghese",
  "enel_x_desc": "Joaquim ha sviluppato e gestione di codice per interfaccia di app. Implementazione e manutenzione di NgRx state management. La tecnologie usate sono HTML, CSS, JavaScript, Angular 8, Kendo Angular, Agile.",
  "conte_it_desc": "Joaquim ha sviluppato e gestito il codice per l'interfaccia di app. Implementazione e manutenzione di Cypress testing per testare componente da app. La tecnologia sono HTML, CSS, JavaScript, Angular 9, Node.js, Agile.",
  "coming_soon": "coming soon",
  "advance": "Avanzato",
  "intermediate": "Intermedio",
  "basic": "Elementare",
  "primary_school_level": "Livello di Scuola Primaria",
  "middle_school_level": "Livello di Scuola Media",
  "high_school_level": "Livello di Scuola Secondaria",
  "university_level": "Livello Universitario",
  "mother_tongue_level": "Livello di de Lingua Madre",
  "beginner_level": "Livello Principiante",
  "see_all_projects": "Visualizzare piu Progetti",
  "fba_blurb": "Una app per che consente ai clienti di prenotare i loro servizi.",
  "mern_blurb": "Una app di task manager eseguita in MongoDB, Express, React e Node.",
  "pig_latin_blurb": "Una app per tradurre qualsiasi testo in pig latin.",
  "econometrics": "Econometria",
  "photography": "Fotografia"
}
