{
  "projects": "Progetti",
  "languages": "Lingue",
  "contact": "Contacto",
  "job_title": "Ingenere Junior Full-Stack di Software",
  "welcome": "Benevenuto. Joaquim lavora come ingerere junior full-stack di software presso a Softwave-Soltec.",
  "cv_title": "CV Sito-Web di Joaquim Barreto",
  "statement": "Ingegnere software full-stack con la passione per la creazione di app Web belle e pienamente funzionanti. Con esperienza in Angular 9, JavaScript e Kubernetes e un background nel cinema, nella fotografia e nell'economia, Joaquim ha scoperto lo sviluppo web attraverso il suo forte desiderio di continuare l'apprendimento. Joaquim porta forti competenze nel team building e nella gestione dei progetti che aiutano a massimizzare la crescita in tutti i principali obiettivi.",
  "here": "qui",
  "see_repositories": "per guardare repositori.",
  "see_cv": "per guardare CV di Joaquim.",
  "adventures": "Adventure in Ingeneria di Software",
  "blog_description": "Andare dall'economista al fotografo / regista all'ingegnere del software ha i suoi pericoli. Esplora le prove e le tribolazioni di Joaquim mentre si allea con il mondo dell'era dell'informazione.",
  "featured_projects": "Featured Projects",
  "open_app": "Open App",
  "freelance_booking_desc": "Questa app è stato il progetto finale di Joaquim alla Flatiron School. È un'app per un libero professionista per lasciare che i clienti prenotino i loro servizi. Utilizza Ruby on Rails con ActiveAdmin sul back-end con Javascript e React sul front-end.",
  "mern_desc": "Questa app è un semplice task manager. Le tecnologie utilizzate nel back-end sono Node.js, Express.js e Mongoose.js. Il front-end è stato fatto in React.js. Il database scelto è MongoDB e l'autenticazione eseguita con JWT. Schierato su Heroku.",
  "pig_latin_desc": "Questa app è il risultato del tentativo di Joaquim di fare la famigerata sfida del codice di traduzione latino maiale. Questa app viene attualmente trasformata in uno stack MEAN utilizzando NgRX.",
  "htotil_desc": "Un'app divertente e l'idea mi è venuta. Tutti hanno sempre questo dilemma quando prendono decisioni. Non più! Poiché questa app ti aiuterà in ogni decisione che prende. Ho fatto questa app usando React Hooks (useState e useEfect) sul frontend. Distribuito su Netlify.",
  "house_md_desc": "Questa app era un progetto di programmazione a coppie durante il modulo 2 alla Flatiron School. È un'app per gli utenti per diagnosticare i sintomi sul proprio corpo. L'app usa su Ruby on Rails sul back-end con Javascript e React sul frontend. Schierato su Heroku.",
  "flatiron_sass_desc": "Questa app è stata il progetto di programmazione a coppie di Joaquim durante il Modulo 3 alla Flatiron School. Un'app per i tutor scolastici per registrare la frequenza degli studenti. Utilizza Ruby on Rails sul back-end con Javascript sul front-end.",
  "sdw_app_desc": "Questa app di prenotazione era un progetto di programmazione di coppia durante il modulo 2 alla Flatiron School. È un'app per gli utenti per prenotare spazio nei cantieri di Pullen per scopi cinematografici e fotografici. L'app viene utilizzata su Ruby su Rails con Bootstrap CSS. Schierato su Heroku.",
  "technical_projects": "Technical Projects",
  "professional_experience": "Professional Experience",
  "technical_skills": "Technical Skills",
  "employment_history": "Storia del Lavoro",
  "education": "Istruzione",
  "photographer": "Photographer",
  "economist": "Economista",
  "filmmaker": "Regista",
  "january": "Gennaio",
  "march": "Marzo",
  "october": "Outobre",
  "december": "Dizembre",
  "july": "Giulo",
  "june": "Giugno",
  "present": "Presente",
  "italy": "Itala",
  "uk": "Regno Unido",
  "london": "Londra",
  "rome": "Roma",
  "china": "Cina"
}
