{
  "projects": "Projects",
  "languages": "Languages",
  "contact": "Contact",
  "job_title": "Junior Full-Stack Software Engineer",
  "welcome": "Welcome. Joaquim currently works as a junior full-stack software engineer at Softwave-Soltec.",
  "cv_title": "CV Website of Joaquim Barreto",
  "statement": "Full-stack software engineer with a passion for building beautiful, fully functioning web apps. With experience in Angular 9, JavaScript, and Kubernetes and a background in film, photography and economics, Joaquim discovered web development through his strong desire for continuing learning. Joaquim brings strong skills in team-building and project management that help maximize growth across all major goals.",
  "here": "here",
  "see_repositories": "to see repositories",
  "see_cv": "to see Joaquim's CV",
  "adventures": "Adventures in Software Engineering",
  "blog_description": "Going from economist to photographer/filmmaker to software engineer does have its perils. Explore Joaquim's trials and tribulations as he graples with the information age world.",
  "featured_projects": "Featured Projects",
  "open_app": "Open App",
  "freelance_booking_desc": "This app was Joaquim's final project at Flatiron School. It is an app for a freelancer to let clients book their services. It uses Ruby on Rails with ActiveAdmin on the backend with Javascript and React on the front end.",
  "mern_desc": "This app is a simple task manager. The technogies used in the back-end are Node.js, Express.js and Mongoose.js. The front-end was done in React.js. The choosen database is MongoDB and authentication done with JWT. Deployed on Heroku.",
  "pig_latin_desc": "This app is a result of Joaquim's attempt to do the infamous pig latin translation code challenge. This app is currently being turned into a MEAN stack using NgRX.",
  "htotil_desc": "A fun app and the idea just came to me. Everyone always have this dilemma when making decisions. No longer! As this app will help in every decision one makes. I did this app using React Hooks (useState and useEfect) on the frontend. Deployed on Netlify.",
  "house_md_desc": "This app was a pair programming project during Module 2 at Flatiron School. It is an app for users to diagnose symptoms on their bodies. The app uses on Ruby on Rails on the backend with Javascript and React on the frontend. Deployed on Heroku.",
  "flatiron_sass_desc": "This app was Joaquim's pair programming project during Module 3 at Flatiron School. An app to for school tutors to record students’ attendance. It uses Ruby on Rails on the backend with Javascript on the front end.",
  "sdw_app_desc": "This booking app was a pair programming project during Module 2 at Flatiron School. It is an app for users to book space in Pullen's yards for film and photography purposes. The app uses on Ruby on Rails with Bootstrap CSS. Deployed on Heroku.",
  "technical_projects": "Technical Projects",
  "professional_experience": "Professional Experience",
  "technical_skills": "Technical Skills",
  "employment_history": "Employment History",
  "education": "Education",
  "photographer": "Photographer",
  "economist": "Economist",
  "filmmaker": "Filmmaker",
  "january": "January",
  "march": "March",
  "october": "October",
  "december": "December",
  "july": "July",
  "june": "June",
  "present": "Present",
  "italy": "Italy",
  "uk": "UK",
  "london": "London",
  "rome": "Rome",
  "china": "China",
  "english": "English",
  "italian": "Italian",
  "mandarin": "Mandarin",
  "japanese": "Japanese",
  "portuguese": "Portuguese"
}
