{
  "projects": "Projectos",
  "languages": "Idiomas",
  "contact": "Contacto",
  "job_title": "Engineiro Full-Stack de Software Junior",
  "welcome": "Benvindo. Joaquim trabalha como un junior full-stack software engineer in Softwave-Soltec.",
  "cv_title": "CV de Joaquim Barreto",
  "statement": "Engenheiro de software full-stack com uma paixão por construir aplicações web bonitas e em pleno funcionamento. Com experiência em Angular 9, JavaScript e Kubernetes e um fundo em cinema, fotografia e economia, Joaquim descobriu o desenvolvimento web através do seu forte desejo de continuar a aprender. Joaquim traz fortes competências na formação de equipas e gestão de projetos que ajudam a maximizar o crescimento em todos os grandes objetivos.",
  "here": "aqui",
  "see_repositories": "para ver repositories.",
  "see_cv": "para ver o CV de Joaquim.",
  "adventures": "Adventuras em Ingeneria de Software",
  "blog_description": "Going from economist to photographer/filmmaker to software engineer does have its perils. Explore Joaquim's trials and tribulations as he graples with the information age world.",
  "featured_projects": "Featured Projects",
  "open_app": "Open App",
  "freelance_booking_desc": "Esta aplicação foi o projeto final de Joaquim na Escola Flatiron. É uma aplicação para um freelancer permitir que os clientes reservem os seus serviços. Usa Ruby on Rails com ActiveAdmin no backend com Javascript e Reagem na parte frontal.",
  "mern_desc": "Esta aplicação é um gestor de tarefas simples. As tecnógias usadas no back-end são Node.js, Express.js e Mongoose.js. A frente foi feita em Re-Reacção.js. A base de dados escolhida é a MongoDB e a autenticação feita com jWT. Implantado em Heroku.",
  "pig_latin_desc": "Esta aplicação é o resultado da tentativa de Joaquim de fazer o infame desafio do código de tradução latina. Esta aplicação está atualmente a ser transformada numa stack MEAN usando o NgRX.",
  "htotil_desc": "Uma aplicação divertida e a ideia acabou de me chegar. Todos têm sempre este dilema quando se decide. Já não! Como esta aplicação vai ajudar em todas as decisões que se toma. Fiz esta aplicação usando React Hooks (useState e useEfect) no frontend. Implantado na Netlify.",
  "house_md_desc": "Esta aplicação foi um projeto de programação de pares durante o Módulo 2 na Flatiron School. É uma aplicação para os utilizadores diagnosticarem sintomas no seu corpo. A aplicação utiliza ruby on Rails no backend com Javascript e Reagir no frontend. Implantado em Heroku.",
  "flatiron_sass_desc": "Esta aplicação foi o projeto de programação de pares de Joaquim durante o Módulo 3 na Flatiron School. Uma aplicação para os professores da escola para registar a frequência dos alunos. Usa Ruby on Rails no backend com Javascript na parte frontal.",
  "sdw_app_desc": "Esta aplicação de reservas foi um projeto de programação de pares durante o Módulo 2 na Flatiron School. É uma aplicação para os utilizadores reservarem espaço nos pátios de Pullen para fins de filme e fotografia. A aplicação utiliza ruby on Rails com Bootstrap CSS. Implantado em Heroku.",
  "technical_projects": "Technical Projects",
  "professional_experience": "Professional Experience",
  "technical_skills": "Technical Skills",
  "employment_history": "Employment History",
  "education": "Educação",
  "photographer": "Fotografo",
  "economist": "Economista",
  "filmmaker": "Filmmaker",
  "january": "Janeiro",
  "march": "Março",
  "october": "Outubro",
  "december": "Dezembro",
  "july": "Julho",
  "june": "Junho",
  "present": "Presente",
  "italy": "Italia",
  "uk": "Reino Unido",
  "london": "Londres",
  "rome": "Roma",
  "china": "China"
}
