{
  "projects": "Projectos",
  "languages": "Idiomas",
  "contact": "Contacto",
  "job_title": "Engenheiro Full-Stack de Software Júnior",
  "software_engineering": "Engenheiria de Software",
  "welcome": "Bem-vindo. O Joaquim trabalha actualmente como engenheiro full-stack de software júnior na Softwave-Soltec.",
  "cv_title": "CV de Joaquim Barreto",
  "statement_title": "Declaração",
  "statement": "Engenheiro full-stack de software com uma paixão por construir aplicações web bonitas e totalmente funcionais. Com experiência em Angular 9, JavaScript e Kubernetes, e formação em cinema, fotografia e economia, o Joaquim descobriu o desenvolvimento web através do seu forte desejo de continuar a aprender. O Joaquim detém sólidas competências na formação de equipas e gestão de projectos que ajudam a maximizar o crescimento de todos os grandes objetivos.",
  "here": "aqui",
  "see_repositories": "Para ver repositórios.",
  "see_cv": "para ver o CV de Joaquim.",
  "adventures": "Aventuras em Engenharia de Software",
  "blog_desc": "Transitar de economista para fotógrafo/realizador, e para engenheiro de software comporta os seus riscos. Explore as privações e as atribulações vividas pelo Joaquim enquanto tenta perceber o mundo da era da informação.",
  "featured_projects": "Projectos em Destaque",
  "open_app": "Abrir a App",
  "freelance_booking_desc": "Esta aplicação foi o projeto final do Joaquim na Escola Flatiron. É uma aplicação destinada a freelancers que permite aos clientes reservarem os seus serviços. Utiliza Ruby on Rails com ActiveAdmin no backend e Javascript e React no frontend.",
  "mern_desc": "Esta aplicação é um gestor de tarefas simples. As tecnologias utilizadas no backend são Node.js, Express.js e Mongoose.js. O frontend foi feito em React.js. A base de dados escolhida foi a MongoDB e a autenticação feita com jWT. Implantado em Heroku.",
  "pig_latin_desc": "Esta aplicação é o produto da tentativa do Joaquim de efectuar o infame desafio de código de tradução pig latin. Esta aplicação está atualmente a ser transformada num MEAN stack utilizando o NgRX.",
  "htotil_desc": "Uma aplicação divertida cuja ideia me ocorreu. Todos enfrentam sempre este dilema quando têm de tomar decisões. Já não, uma vez que esta aplicação vai ajudar em todas as decisões a tomar! Fiz esta aplicação utilizando React Hooks (useState e useEfect) no frontend. Implantado na Netlify.",
  "house_md_desc": "Esta aplicação foi um projeto de programação efectuado em parceria durante o Módulo 2 na Escola Flatiron. É uma aplicação para os utilizadores diagnosticarem sintomas no seu corpo. A aplicação utiliza Ruby on Rails no backend e Javascript e React no frontend. Implantado em Heroku.",
  "flatiron_sass_desc": "Esta aplicação foi um projeto de programação efectuado em parceria pelo Joaquim durante o Módulo 3 na Escola Flatiron. Uma aplicação para os professores da escola registarem a assiduidade dos alunos. Utiliza Ruby on Rails no backend e Javascript no frontend.",
  "sdw_app_desc": "Esta aplicação de reservas foi um projeto de programação efectuado em parceria durante o Módulo 2 na Escola Flatiron. É uma aplicação para os utilizadores reservarem espaços nos pátios de Pullen para filmagens e fotografia. A aplicação utiliza Ruby on Rails com Bootstrap CSS. Implantado em Heroku.",
  "technical_projects": "Projectos técnicos",
  "professional_experience": "Experiência profissional",
  "technical_skills": "Competências técnicas",
  "employment_history": "Histórico de emprego",
  "education": "Educação",
  "photographer": "Fotógrafo",
  "economist": "Economista",
  "filmmaker": "Realizador",
  "january": "Janeiro",
  "march": "Março",
  "october": "Outubro",
  "december": "Dezembro",
  "july": "Julho",
  "june": "Junho",
  "present": "Presente",
  "italy": "Itália",
  "uk": "Reino Unido",
  "london": "Londres",
  "rome": "Roma",
  "china": "China",
  "english": "Inglês",
  "italian": "Italiano",
  "mandarin": "Chinês",
  "japanese": "Japonês",
  "portuguese": "Português",
  "enel_x_desc": "O Joaquim desenvolveu e manteve o código e a interface de uma aplicação. Implementação e manutenção da gestão do estado de NgRx. A tecnologia utilizada foi HTML, CSS, JavaScript, Angular 8, Kendo Angular, Ágile",
  "conte_it_desc": "O Joaquim desenvolveu e manteve o código e a interface de uma aplicação. Implementação e manutenção de testes Cypress para testar os componentes de uma aplicação. A tecnologia utilizada foi HTML, CSS, JavaScript, Angular 9, Node.js, Ágile",
  "coming_soon": "Em breve",
  "advance": "Avançado",
  "intermediate": "Médio",
  "basic": "Básico",
  "primary_school_level": "Grau da Escola Primária",
  "middle_school_level": "Grau da Escola Básica",
  "high_school_level": "Grau da Escola Secundária",
  "university_level": "Grau universitário",
  "mother_tongue_level": "Grau da Língua-mãe",
  "beginner_level": "Grau de Iniciante",
  "see_all_projects": "Ver Todos os Projetos",
  "fba_blurb": "Uma aplicação destinada a freelancers, que permite que os clientes reservem os seus serviços.",
  "mern_blurb": "Uma aplicação simples de gestão de tarefas feita em MongoDB, Express, React e Node.",
  "pig_latin_blurb": "Uma aplicação para traduzir qualquer texto para pig latin."
}
